函数是最基础的组织代码的方式
# 定义
def 函数名(参数): 函数体
# 命名空间、作用域、本地函数
+ 变量:全局global、局部变量
+ 命名空间：任意变量默认分配在本地命名空间
# 返回多个值
+ return a,b,c
+ return 元组
+ return 字典
# 函数是对象
可将函数作为参数传递给其他函数
# 匿名函数
lanmbda函数：声明一个匿名函数

匿名函数非常便于进行数据分析，代码量最小，可以作为参数进行传值

变量 = lambda x : 函数体

# 生成器
## 定义
用于生成可遍历对象，用yield进行定义

def squares(n=10):

for i in range(1,n+1):
  yield i**2
## 生成器表达式
gen = (x**2 for x in range(100))

将()换成{}、[]即可调整生成集合或列表

##itertools模块
用于大多数算法的生成器集合，具有一系列函数，对容器进行操作
# 错误和异常处理
try:
  常识执行的代码
except:
  对捕获异常的处理
finally:
  必定执行的代码
